一个黑人在金山前，迎风独立，陷入沉思。

那年，农场主把一个秘密任务交给黑人奴隶，让他带着一个没有钥匙孔的保险箱南下寻找巫师，限一个月返回。黑人从小在农场长大，从未去过外面的世界，尽管吝啬的农场主对他并不很好，黑人小伙也勤勤恳恳，过得也还愉快。黑人带着保险箱出发了，在肯尼亚的沙漠遇到一个骨瘦如柴，饥肠辘辘的小男孩，他可怜他，把自己为数不多的食物分享给小男孩，但这仅仅只够两人勉强活着，饥饿一点也没有从小男孩身体离开。就这样缓缓行了数十日，终于到达了巫师的小屋。巫师一看保险箱便知道了这对黑人兄弟的来意，割开了保险箱，倒出一箱子石头。巫师严辞警告他们不要作声，让他们到外面等着。在巫师的咒语中，饥困交加的小男孩靠在门前很快进入梦乡。梦中他大叫咒语“面包！”，便掉下来好多好多的面包，正在他大吃特吃时，发现巫师对他怒目而视。原来他的梦呓打断了巫师点石成金的咒语，保险箱里的原料石全都变成了面包。

黑人无奈，把面包分给了小男孩，自己背起空箱子准备回去。巫师提议黑人不要再回去了，远走他乡隐姓埋名。黑人执意要回去，他说那是他长大的地方，农场主不会拿他怎么样的。男孩吃了几个面包后，良心很过不去，执意要跟黑人一起回去承担罪责。黑人拗不过，带着小男孩和一箱面包返回了农场。

见到农场主，农场主根本不相信黑人的言辞，认为他一定是偷藏了黄金。农场主让打手毒打他，企图从他口中套出黄金的下落。见黑人死不改口，挥舞的鞭子越来越重。黑人就这样被毒打致死，小男孩瑟瑟发抖，赶紧逃回了沙漠。

男孩找到巫师，跪在他面前。“教我点石成金术吧！”跪了三天三夜，风雨浸湿了他的衣服，烈日灼伤了他的后背，砂石狠狠地敲打他的膝盖。巫师还是不答应男孩的请求。“你走吧！点石成金术需要没有一丝污染的心和比钢铁还要坚强的毅力，你不会成功的。”巫师扔给男孩一块金条，“够你用大半辈子了，走吧！”男孩不动于衷，再饿的经历都经过，再苦的磨难也爬过，如果不能为黑人恩人伸张正义，一切又有什么意义。眼泪落在金条上，金条化作了沙子。

巫师见到，眼睛放光，终于收他为徒。

十年苦练，小男孩长大成人，也习得了巫师的全部法术。他告别师父，北上穿过沙漠，再一次出现在农场。

“想要点石成金吗？我可以帮你。”年轻的巫师施放咒语，将门口的一块砖变成金砖。

农场主喜出望外，连忙迎着贵客到内屋。巫师赠给他一个点金手，“所触之物皆可成金。”便离开了。

夜里，农场主小心翼翼地握紧点金手，轻轻点了一下烛台，烛台闪耀出金灿灿的光芒，他又点石桌，石桌变成金块，点金手所触之物，椅子、柜子都变成了金块。农场主乐开了花，得意忘形地点了一下房梁，整个房子都变成了金块。只听见轰的一声，金砖活埋了农场主。

从回忆中缓过神来，黑人捡起点金手，金山化为一座废墟。背对废墟，黑人向沙漠深处走去。每走一步，掉一根头发，每掉一跟头发，长出一颗小树。走了东方发白时，黑人巫师的头发掉光了，他倒在地上，融化在沙漠里。血液变成湖泊，身体变成山脉，其余化作土壤。肯尼亚从此多出一座有山有水的花园。


